{
  "displayName": "<PREFIX> - Data protection - O365: Use app enforced restrictions When using a browser on untrusted devices",
  "createdDateTime": null,
  "modifiedDateTime": null,
  "state": "disabled",
  "grantControls": null,
  "conditions": {
    "signInRiskLevels": [],
    "clientAppTypes": [
      "browser"
    ],
    "platforms": null,
    "locations": null,
    "applications": {
      "includeApplications": [
        "Office365"
      ],
      "excludeApplications": [],
      "includeUserActions": []
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "excludeGroups": [
        "<ExclusionGroup>",
        "<EmergencyAccessAccountsGroup>"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "deviceStates": {
      "includeStates": [
        "All"
      ],
      "excludeStates": [
        "Compliant",
        "DomainJoined"
      ]
    }
  },
  "sessionControls": {
    "cloudAppSecurity": null,
    "signInFrequency": null,
    "persistentBrowser": null,
    "applicationEnforcedRestrictions": {
      "isEnabled": true
    }
  }
}