{
  "displayName": "<PREFIX> - Base protection - All apps: Require MFA For AADP2 users When medium risk is detected",
  "createdDateTime": null,
  "modifiedDateTime": null,
  "state": "disabled",
  "sessionControls": null,
  "conditions": {
    "signInRiskLevels": [
      "medium"
    ],
    "clientAppTypes": [],
    "platforms": null,
    "locations": null,
    "deviceStates": null,
    "devices": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": []
    },
    "users": {
      "includeUsers": [],
      "excludeUsers": [
        "GuestsOrExternalUsers"
      ],
      "includeGroups": [
        "<AADP2Group>"
      ],
      "excludeGroups": [
        "<ExclusionGroup>",
        "<EmergencyAccessAccountsGroup>"
      ],
      "includeRoles": [],
      "excludeRoles": []
    }
  },
  "grantControls": {
    "operator": "OR",
    "builtInControls": [
      "mfa"
    ],
    "customAuthenticationFactors": [],
    "termsOfUse": []
  }
}