{
  "displayName": "<PREFIX> - Data protection - All apps: Short Sign-in frequency When on untrusted device",
  "createdDateTime": null,
  "modifiedDateTime": null,
  "state": "disabled",
  "grantControls": null,
  "conditions": {
    "signInRiskLevels": [],
    "clientAppTypes": [],
    "platforms": null,
    "locations": null,
    "applications": {
      "includeApplications": [
        "All"
      ],
      "excludeApplications": [],
      "includeUserActions": []
    },
    "users": {
      "includeUsers": [
        "All"
      ],
      "excludeUsers": [],
      "includeGroups": [],
      "excludeGroups": [
        "<ExclusionGroup>",
        "<EmergencyAccessAccountsGroup>"
      ],
      "includeRoles": [],
      "excludeRoles": []
    },
    "deviceStates": {
      "includeStates": [
        "All"
      ],
      "excludeStates": [
        "Compliant",
        "DomainJoined"
      ]
    }
  },
  "sessionControls": {
    "applicationEnforcedRestrictions": null,
    "cloudAppSecurity": null,
    "persistentBrowser": null,
    "signInFrequency": {
      "value": 1,
      "type": "hours",
      "isEnabled": true
    }
  }
}